#+TITLE: Masonry style layout with JavaScript and CSS Grid

As a long term web developer, I've been dealing with different resolutions and
the issues they cause with layout for over 2 decades now. For a brief period I
thought we started having similar displays... then smart-phones came in. Sigh.

Basically, for a large wide screen we want a 3 column layout. Medium? 2. Tiny? 

[[https://medium.com/@andybarefoot/a-masonry-style-layout-using-css-grid-8c663d355ebb][Andy Barefoot]] has a wonderful article on how to use the CSS grid and, with a
little bit of JavaScript, have the masonry like layout I so desire. There's a
nice [[https://codepen.io/andybarefoot/pen/QMeZda][CodePen]] to go along with it.

One of the issues with that is it specifies a width for every brick, and we want
to change it. [[https://css-tricks.com/piecing-together-approaches-for-a-css-masonry-layout/][As luck would have it,]] there are a few approaches based on the CSS
grid. [[https://w3bits.com/css-grid-masonry/][This one]] is based off of the first, but has a [[https://w3bits.com/tools/masonry-generator/][generator]] that essentially
does the layout for us.

* Literate Tangling 

Because our linting needs certain things to be indented, we fsck with noweb a wee bit.

#+begin_src emacs-lisp
  (setq-local org-babel-noweb-wrap-start "code:<<")
  (add-hook 'org-babel-post-tangle-hook #'delete-trailing-whitespace)

  (add-hook 'org-babel-post-tangle-hook #'save-buffer :append)
  
  (setq js-indent-level 2)
  ;; # Local Variables:
  ;; # org-babel-noweb-wrap-start: "code:<<"
  ;; # End:
#+end_src

#+RESULTS:
| delete-trailing-whitespace | save-buffer |
